# Этап 1: Сборка
FROM golang:1.23 AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем только go.mod для кэширования зависимостей
COPY go.mod ./

# Загружаем все зависимости (это автоматически создаст go.sum)
RUN go mod tidy

# Копируем все файлы проекта в рабочую директорию контейнера
COPY . .

# Загружаем все модули, чтобы go.sum был актуален
RUN go mod download

# Собираем исполняемый файл
RUN go build -o /go-app cmd/main.go

# Этап 2: Запуск
FROM alpine:latest

# Устанавливаем рабочую директорию для приложения
WORKDIR /root/

# Устанавливаем сертификаты, если требуется
RUN apk add --no-cache ca-certificates

# Копируем скомпилированный бинарный файл из стадии сборки
COPY --from=builder /go-app /usr/local/bin/

# Устанавливаем права на исполнение для бинарного файла
RUN chmod +x /usr/local/bin/go-app

# Экспонируем порт, на котором приложение будет слушать
EXPOSE 14704

# Команда для запуска приложения
CMD ["go-app"]
